In [3]:
Basic Python

1. Split this string

In [4]:
s = "Hi there Sam!"

s.split(" ")

['Hi', 'there', 'Sam!']

In [10]:
# 2. Use.format() to print the following string.

# Output should be: The diameter of Earth is 12742 kilometers.

In [12]:
planet = "Earth"

diameter = 12742

print("The diameter of {} is {} kilometers.".format(planet, diameter))

The diameter of Earth is 12742 kilometers.

In [14]:
# 3. In this nest dictionary grab the word "hello"

In [15]:
d = {'k1':[1,2,3,{'tricky':['oh','man','inception',{'target':[1,2,3,'hello']}]}]}

d['k1'][3]['tricky'][3]['target'][3]

'hello'

In [16]:
# Numpy

In [17]:
import numpy as np

In [18]:
# 4.1 Create an array of 10 zeros?

# 4.2 Create an array of 10 fives?

In [19]:
array_zeros = np.zeros(10)

array_zeros

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [20]:
array_fives = np.ones(10)*5

array_fives

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

In [21]:
# 5. Create an array of all the even integers from 20 to 35

In [22]:
array_even = np.arange(20,35,2)

array_even

array([20, 22, 24, 26, 28, 30, 32, 34])

In [25]:
# 6. Create a 3x3 matrix with values ranging from 0 to 8

In [26]:
array_three = np.arange(0, 9).reshape(3,3)

array_three

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [27]:
# 7. Concatenate a and b

# a = np.array([1, 2, 3]), b = np.array([4, 5, 6])

In [28]:
a = np.array([1, 2, 3])

b = np.array([4, 5, 6])

array_concat = np.concatenate((a, b), axis=0)

In [29]:
array_concat

array([1, 2, 3, 4, 5, 6])

In [30]:
# Pandas

# 8. Create a dataframe with 3 rows and 2 columns

In [31]:
import pandas as pd

In [32]:
list1 = [['John', 21], ['Jane', 25], ['Mary', 21]]

In [33]:
list1 = pd.DataFrame(list1)

In [34]:
list1

      0   1
0  John  21
1  Jane  25
2  Mary  21

In [35]:
# 9. Generate the series of dates from 1st Jan, 2023 to 10th Feb, 2023

In [36]:
dates = pd.date_range(start='2023-01-01', end='2023-02-10')

dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01',
               '2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09',
               '2023-02-10'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
# 10. Create 2D list to DataFrame

# lists = [[1, 'aaa', 22], [2, 'bbb', 25], [3, 'ccc', 24]]

In [38]:
lists = [[1, 'aaa', 22], [2, 'bbb', 25], [3, 'ccc', 24]]

pd.DataFrame(lists)

   0    1   2
0  1  aaa  22
1  2  bbb  25
2  3  ccc  24